# Basic SQL

## Pre-requisition

In [31]:
import pandas as pd
import sqlite3

In [32]:
conn = sqlite3.connect("dvd_rental/sqlite-sakila.db")

## SELECT

Select is used for retrieve data from one or more tables.

**Example**

> SELECT column_name FROM table_name

### All data using *

In [33]:
query = "SELECT * from actor"

df = pd.read_sql_query(query, conn)
df.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2021-03-06 15:51:59
1         2       NICK      WAHLBERG  2021-03-06 15:51:59
2         3         ED         CHASE  2021-03-06 15:51:59
3         4   JENNIFER         DAVIS  2021-03-06 15:51:59
4         5     JOHNNY  LOLLOBRIGIDA  2021-03-06 15:51:59

### Specific data

In [34]:

query = "SELECT first_name, last_name FROM actor"
df = pd.read_sql_query(query, conn)
df.head()

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA

### Challenge

Grab the customer id payment date and amount for the every customer.

In [35]:
query = "SELECT customer_id, amount, payment_date from payment;"
df = pd.read_sql_query(query, conn)

df

       customer_id  amount             payment_date
0                1    2.99  2005-05-25 11:30:37.000
1                1    0.99  2005-05-28 10:35:23.000
2                1    5.99  2005-06-15 00:54:12.000
3                1    0.99  2005-06-15 18:02:53.000
4                1    9.99  2005-06-15 21:08:46.000
...            ...     ...                      ...
16044          599    4.99  2005-08-21 17:43:42.000
16045          599    1.99  2005-08-21 21:41:57.000
16046          599    8.99  2005-08-23 06:09:44.000
16047          599    2.99  2005-08-23 11:08:46.000
16048          599    2.99  2005-08-23 11:25:00.000

[16049 rows x 3 columns]

## SELECT DISTINCT

DISTINCT statement is used to filter the result set of query and retrieve only unique rows from specific column or combination of columns.

Useful when want to eliminate duplicates.

 ⚠️❗**Only first occurrence is returned from data.**

> SELECT DISTINCT column_name FROM table_name

In [36]:
query = "SELECT DISTINCT release_year FROM  film;"
df = pd.read_sql_query(query, conn)

df

  release_year
0         2006

### Challenge

Identify unique first names across all customers in the database.

In [37]:
query = "SELECT DISTINCT first_name from customer;"
df = pd.read_sql_query(query, conn)

df

    first_name
0         MARY
1     PATRICIA
2        LINDA
3      BARBARA
4    ELIZABETH
..         ...
586   TERRENCE
587    ENRIQUE
588    FREDDIE
589       WADE
590     AUSTIN

[591 rows x 1 columns]

## COUNT

Aggregate function which allows you to count number of rows that match the specific criteria within the table or specific result.

> Returns single value.

### Example

Count the number of unique rating within film.

In [38]:
query = " SELECT COUNT (DISTINCT rating) FROM film;"
df = pd.read_sql_query(query, conn)

df

   COUNT (DISTINCT rating)
0                        5

### Example

Count the number of rows

In [39]:
query = "SELECT COUNT(*) FROM film;"
df = pd.read_sql_query(query, conn)

df

   COUNT(*)
0      1000

### Example

Count NON-NULL rows in specific column

In [40]:
query = "SELECT COUNT(description) from film;"
df = pd.read_sql_query(query, conn)

df

   COUNT(description)
0                1000